vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA153_DFP.pdsc
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MCXA153.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MCXA153.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXA153_header"/>
      <require condition="device.MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.aoi.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA153.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXA153.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.cache_lpcac_n4a_mcxn.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.cdog.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.mcx_spc, device=MCXA153.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mcx_spc, device=MCXA153.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mcx_spc"/>
      <require condition="device.MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_gpio.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXA153.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXA153.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="GPIO" Capiversion="1.0.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device_id.MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXA153, device.RTE, device_id=MCXA153, driver.lpi2c_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXA153, device.RTE, device_id=MCXA153, driver.lpi2c_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpi2c, device_id=MCXA153.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXA153.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpi2c, device_id=MCXA153.internal_condition">
      <accept condition="allOf.driver.lpi2c, device_id=MCXA153.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c, device_id=MCXA153.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXA153, device.RTE, device_id=MCXA153, driver.lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXA153, device.RTE, device_id=MCXA153, driver.lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpspi, device_id=MCXA153.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXA153.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpspi, device_id=MCXA153.internal_condition">
      <accept condition="allOf.driver.lpspi, device_id=MCXA153.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device_id=MCXA153.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXA153, device.RTE, device_id=MCXA153, driver.lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXA153, device.RTE, device_id=MCXA153, driver.lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpuart, device_id=MCXA153.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXA153.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpuart, device_id=MCXA153.internal_condition">
      <accept condition="allOf.driver.lpuart, device_id=MCXA153.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart, device_id=MCXA153.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MCXA153.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MCXA153.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm33.condition_id">
      <require condition="cores.cm33.internal_condition"/>
    </condition>
