vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA153_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA153_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA153_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA153/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA153/MCXA153.h" projectpath="device"/>
        <file category="header" name="devices/MCXA153/MCXA153_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA153/MCXA153_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA153/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_AOI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_CDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_CMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_CRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_CTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_DEBUGMAILBOX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_EIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_EQDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_ERM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_FMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_FMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_FMUTEST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_FREQME.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_GLIKEY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_INPUTMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_LPCMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_LPTMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_MRCC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_OSTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_PORT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_SCG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_SPC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_SYSCON.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_TRDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_UTICK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_VBAT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_WAKETIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_WUU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MCXA153/periph/PERI_WWDT.h" projectpath="device/periph"/>
        <file category="include" name="devices/MCXA153/"/>
        <file category="include" name="devices/MCXA153/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA153/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA153/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA153_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA153_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA153.condition_id" category="linkerScript" name="devices/MCXA153/arm/MCXA153_flash.scf" projectpath="MCXA153/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA153.condition_id" category="linkerScript" name="devices/MCXA153/arm/MCXA153_ram.scf" projectpath="MCXA153/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA153.condition_id" category="linkerScript" name="devices/MCXA153/gcc/MCXA153_flash.ld" projectpath="MCXA153/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA153.condition_id" category="linkerScript" name="devices/MCXA153/gcc/MCXA153_ram.ld" projectpath="MCXA153/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA153.condition_id" category="linkerScript" name="devices/MCXA153/iar/MCXA153_flash.icf" projectpath="MCXA153/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA153.condition_id" category="linkerScript" name="devices/MCXA153/iar/MCXA153_ram.icf" projectpath="MCXA153/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXA153" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXA153</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA153/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA153/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA153/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA153/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA153/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA153/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA153/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA153/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA153/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXA153_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MCXA153/iar/startup_MCXA153.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MCXA153/gcc/startup_MCXA153.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MCXA153/arm/startup_MCXA153.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
